Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_regdef.h
/** \brief  Access Enable SRC[31:16] TOS6, Register 0 */
typedef struct _Ifx_INT_ACCEN_SRC_TOS60_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID 0 (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID 1 (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID 2 (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID 3 (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID 4 (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID 5 (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID 6 (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID 7 (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID 8 (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID 9 (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID 10 (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID 11 (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID 12 (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID 13 (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID 14 (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID 15 (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID 16 (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID 17 (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID 18 (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID 19 (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID 20 (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID 21 (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID 22 (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID 23 (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID 24 (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID 25 (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID 26 (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID 27 (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID 28 (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID 29 (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID 30 (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID 31 (rw) */
} Ifx_INT_ACCEN_SRC_TOS60_Bits;

/** \brief  Access Enable SRC[15:0] TOS6, Register 1 */
typedef struct _Ifx_INT_ACCEN_SRC_TOS61_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_INT_ACCEN_SRC_TOS61_Bits;

/** \brief  Access Enable SRC[31:16] TOS7, Register 0 */
typedef struct _Ifx_INT_ACCEN_SRC_TOS70_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID 0 (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID 1 (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID 2 (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID 3 (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID 4 (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID 5 (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID 6 (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID 7 (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID 8 (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID 9 (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID 10 (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID 11 (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID 12 (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID 13 (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID 14 (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID 15 (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID 16 (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID 17 (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID 18 (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID 19 (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID 20 (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID 21 (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID 22 (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID 23 (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID 24 (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID 25 (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID 26 (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID 27 (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID 28 (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID 29 (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID 30 (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID 31 (rw) */
} Ifx_INT_ACCEN_SRC_TOS70_Bits;

/** \brief  Access Enable SRC[15:0] TOS7, Register 1 */
typedef struct _Ifx_INT_ACCEN_SRC_TOS71_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_INT_ACCEN_SRC_TOS71_Bits;

/** \brief  Error Capture Register */
typedef struct _Ifx_INT_ICU_ECR_Bits
{
    unsigned int PN:8;                      /**< \brief [7:0] Service Request Priority Number (rwh) */
    unsigned int reserved_8:2;              /**< \brief \internal Reserved */
    unsigned int ECC:5;                     /**< \brief [14:10] Service Request ECC (rwh) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int ID:10;                     /**< \brief [25:16] Service Request Node Index Number (rwh) */
    unsigned int reserved_26:4;             /**< \brief \internal Reserved */
    unsigned int EOV:1;                     /**< \brief [30:30] Error Overflow Bit (rwh) */
    unsigned int STAT:1;                    /**< \brief [31:31] Error Status Bit (rwh) */
} Ifx_INT_ICU_ECR_Bits;

/** \brief  Last Acknowledged Service Request Register */
typedef struct _Ifx_INT_ICU_LASR_Bits
{
    unsigned int PN:8;                      /**< \brief [7:0] Last Acknowledged Service Request Priority Number (r) */
    unsigned int reserved_8:2;              /**< \brief \internal Reserved */
    unsigned int ECC:5;                     /**< \brief [14:10] Last Acknowledged Interrupt ECC (r) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int ID:10;                     /**< \brief [25:16] Last Acknowledged Interrupt SRN Index Number (r) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_INT_ICU_LASR_Bits;

/** \brief  Latest Winning Service Request Register */
typedef struct _Ifx_INT_ICU_LWSR_Bits
{
    unsigned int PN:8;                      /**< \brief [7:0] Latest Winner Priority Number (r) */
    unsigned int reserved_8:2;              /**< \brief \internal Reserved */
    unsigned int ECC:5;                     /**< \brief [14:10] Latest Winner ECC (r) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int ID:10;                     /**< \brief [25:16] Latest Winner Index Number (r) */
    unsigned int reserved_26:5;             /**< \brief \internal Reserved */
    unsigned int STAT:1;                    /**< \brief [31:31] LWSR Register Status (r) */
} Ifx_INT_ICU_LWSR_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_INT_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MOD_NUMBER:16;             /**< \brief [31:16] Module Number Value (r) */
} Ifx_INT_ID_Bits;

/** \brief  OTGM IRQ Trace */
typedef struct _Ifx_INT_OIT_Bits
{
    unsigned int TOS0:3;                    /**< \brief [2:0] Type of Service for Observation on OTGB0 (rw) */
    unsigned int reserved_3:4;              /**< \brief \internal Reserved */
    unsigned int OE0:1;                     /**< \brief [7:7] Output Enable for OTGB0 (rw) */
    unsigned int TOS1:3;                    /**< \brief [10:8] Type of Service for Observation on OTGB1 (rw) */
    unsigned int reserved_11:4;             /**< \brief \internal Reserved */
    unsigned int OE1:1;                     /**< \brief [15:15] Output Enable for OTGB1 (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_INT_OIT_Bits;

/** \brief  OTGM IRQ MUX Missed IRQ Select */
typedef struct _Ifx_INT_OIXMS_Bits
{
    unsigned int MIRQ:10;                   /**< \brief [9:0] SRN Index for Missed Interrupt Trigger (rw) */
    unsigned int reserved_10:22;            /**< \brief \internal Reserved */
} Ifx_INT_OIXMS_Bits;

