Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_regdef.h
/** \brief  OTGM IRQ MUX Select 0 */
typedef struct _Ifx_INT_OIXS0_Bits
{
    unsigned int IRQ0:10;                   /**< \brief [9:0] SRN Index for Interrupt Trigger 0 (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int IRQ1:10;                   /**< \brief [25:16] SRN Index for Interrupt Trigger 1 (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_INT_OIXS0_Bits;

/** \brief  OTGM IRQ MUX Select 1 */
typedef struct _Ifx_INT_OIXS1_Bits
{
    unsigned int IRQ2:10;                   /**< \brief [9:0] SRN Index for Interrupt Trigger 2 (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int IRQ3:10;                   /**< \brief [25:16] SRN Index for Interrupt Trigger 3 (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_INT_OIXS1_Bits;

/** \brief  OTGM IRQ MUX Trigger Set Select */
typedef struct _Ifx_INT_OIXTS_Bits
{
    unsigned int TGS:2;                     /**< \brief [1:0] Trigger Set Select for OTGB0/1 Overlay (rw) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int OBS:2;                     /**< \brief [9:8] Overlay Byte Select (rw) */
    unsigned int reserved_10:22;            /**< \brief \internal Reserved */
} Ifx_INT_OIXTS_Bits;

/** \brief  OTGM MCDS I/F Sensitivity Negedge */
typedef struct _Ifx_INT_OMISN_Bits
{
    unsigned int OTGB0:16;                  /**< \brief [15:0] Bitwise Negedge Sensitivity for OTGB0 (rw) */
    unsigned int OTGB1:16;                  /**< \brief [31:16] Bitwise Negedge Sensitivity for OTGB1 (rw) */
} Ifx_INT_OMISN_Bits;

/** \brief  OTGM MCDS I/F Sensitivity Posedge */
typedef struct _Ifx_INT_OMISP_Bits
{
    unsigned int OTGB0:16;                  /**< \brief [15:0] Bitwise Posedge Sensitivity for OTGB0 (rw) */
    unsigned int OTGB1:16;                  /**< \brief [31:16] Bitwise Posedge Sensitivity for OTGB1 (rw) */
} Ifx_INT_OMISP_Bits;

/** \brief  OTGM OTGB0/1 Status */
typedef struct _Ifx_INT_OOBS_Bits
{
    unsigned int OTGB0:16;                  /**< \brief [15:0] Status of OTGB0 (rh) */
    unsigned int OTGB1:16;                  /**< \brief [31:16] Status of OTGB1 (rh) */
} Ifx_INT_OOBS_Bits;

/** \brief  OTGM SSI Control */
typedef struct _Ifx_INT_OSSIC_Bits
{
    unsigned int TGS:2;                     /**< \brief [1:0] Trigger Set for OTGB0/1 (rw) */
    unsigned int TGB:1;                     /**< \brief [2:2] OTGB0/1 Bus Select (rw) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_INT_OSSIC_Bits;

/** \brief  Service Request Broadcast Register */
typedef struct _Ifx_INT_SRB_Bits
{
    unsigned int TRIG0:1;                   /**< \brief [0:0] General Purpose Service Request Trigger 0 (w) */
    unsigned int TRIG1:1;                   /**< \brief [1:1] General Purpose Service Request Trigger 1 (w) */
    unsigned int TRIG2:1;                   /**< \brief [2:2] General Purpose Service Request Trigger 2 (w) */
    unsigned int TRIG3:1;                   /**< \brief [3:3] General Purpose Service Request Trigger 3 (w) */
    unsigned int TRIG4:1;                   /**< \brief [4:4] General Purpose Service Request Trigger 4 (w) */
    unsigned int TRIG5:1;                   /**< \brief [5:5] General Purpose Service Request Trigger 5 (w) */
    unsigned int TRIG6:1;                   /**< \brief [6:6] General Purpose Service Request Trigger 6 (w) */
    unsigned int TRIG7:1;                   /**< \brief [7:7] General Purpose Service Request Trigger 7 (w) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_INT_SRB_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_union
 * \{  */

/** \brief  Access Enable CONFIG, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_CONFIG0_Bits B;           /**< \brief Bitfield access */
} Ifx_INT_ACCEN_CONFIG0;

/** \brief  Access Enable CONFIG, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_CONFIG1_Bits B;           /**< \brief Bitfield access */
} Ifx_INT_ACCEN_CONFIG1;

/** \brief  Access Enable SRB0, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB00_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB00;

/** \brief  Access Enable SRB0, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB01_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB01;

/** \brief  Access Enable SRB1, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB10_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB10;

/** \brief  Access Enable SRB1, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB11_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB11;

/** \brief  Access Enable SRB2, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB20_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB20;

