Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_regdef.h
/** \brief  Access Enable SRB2, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB21_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB21;

/** \brief  Access Enable SRB3, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB30_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB30;

/** \brief  Access Enable SRB3, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB31_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB31;

/** \brief  Access Enable SRB4, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB40_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB40;

/** \brief  Access Enable SRB4, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB41_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB41;

/** \brief  Access Enable SRB5, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB50_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB50;

/** \brief  Access Enable SRB5, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRB51_Bits B;             /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRB51;

/** \brief  Access Enable SRC[31:16] TOS0, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS00_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS00;

/** \brief  Access Enable SRC[15:0] TOS0, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS01_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS01;

/** \brief  Access Enable SRC[31:16] TOS1, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS10_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS10;

/** \brief  Access Enable SRC[15:0] TOS1, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS11_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS11;

/** \brief  Access Enable SRC[31:16] TOS2, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS20_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS20;

/** \brief  Access Enable SRC[15:0] TOS2, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS21_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS21;

/** \brief  Access Enable SRC[31:16] TOS3, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS30_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS30;

/** \brief  Access Enable SRC[15:0] TOS3, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS31_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS31;

/** \brief  Access Enable SRC[31:16] TOS4, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS40_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS40;

/** \brief  Access Enable SRC[15:0] TOS4, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS41_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS41;

/** \brief  Access Enable SRC[31:16] TOS5, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS50_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS50;

/** \brief  Access Enable SRC[15:0] TOS5, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS51_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS51;

