Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxInt_regdef.h
/** \brief  Access Enable SRC[31:16] TOS6, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS60_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS60;

/** \brief  Access Enable SRC[15:0] TOS6, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS61_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS61;

/** \brief  Access Enable SRC[31:16] TOS7, Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS70_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS70;

/** \brief  Access Enable SRC[15:0] TOS7, Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ACCEN_SRC_TOS71_Bits B;         /**< \brief Bitfield access */
} Ifx_INT_ACCEN_SRC_TOS71;

/** \brief  Error Capture Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ICU_ECR_Bits B;                 /**< \brief Bitfield access */
} Ifx_INT_ICU_ECR;

/** \brief  Last Acknowledged Service Request Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ICU_LASR_Bits B;                /**< \brief Bitfield access */
} Ifx_INT_ICU_LASR;

/** \brief  Latest Winning Service Request Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ICU_LWSR_Bits B;                /**< \brief Bitfield access */
} Ifx_INT_ICU_LWSR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_ID_Bits B;                      /**< \brief Bitfield access */
} Ifx_INT_ID;

/** \brief  OTGM IRQ Trace */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OIT_Bits B;                     /**< \brief Bitfield access */
} Ifx_INT_OIT;

/** \brief  OTGM IRQ MUX Missed IRQ Select */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OIXMS_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OIXMS;

/** \brief  OTGM IRQ MUX Select 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OIXS0_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OIXS0;

/** \brief  OTGM IRQ MUX Select 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OIXS1_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OIXS1;

/** \brief  OTGM IRQ MUX Trigger Set Select */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OIXTS_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OIXTS;

/** \brief  OTGM MCDS I/F Sensitivity Negedge */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OMISN_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OMISN;

/** \brief  OTGM MCDS I/F Sensitivity Posedge */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OMISP_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OMISP;

/** \brief  OTGM OTGB0/1 Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OOBS_Bits B;                    /**< \brief Bitfield access */
} Ifx_INT_OOBS;

/** \brief  OTGM SSI Control */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OSSIC_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OSSIC;

/** \brief  Service Request Broadcast Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_SRB_Bits B;                     /**< \brief Bitfield access */
} Ifx_INT_SRB;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  Interrupt router channel */
typedef volatile struct _Ifx_INT_ICU
{
    Ifx_INT_ICU_LWSR LWSR;                  /**< \brief 0, Latest Winning Service Request Register */
    Ifx_INT_ICU_LASR LASR;                  /**< \brief 4, Last Acknowledged Service Request Register */
    Ifx_INT_ICU_ECR ECR;                    /**< \brief 8, Error Capture Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
} Ifx_INT_ICU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  Interrupt router object */
typedef volatile struct _Ifx_INT
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_INT_ID ID;                          /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_INT_SRB SRB[6];                     /**< \brief 10, Service Request Broadcast Register 0 */
    unsigned char reserved_28[88];          /**< \brief 28, \internal Reserved */
    Ifx_INT_OOBS OOBS;                      /**< \brief 80, OTGM OTGB0/1 Status */
    Ifx_INT_OSSIC OSSIC;                    /**< \brief 84, OTGM SSI Control */
    Ifx_INT_OIXTS OIXTS;                    /**< \brief 88, OTGM IRQ MUX Trigger Set Select */
    Ifx_INT_OIXMS OIXMS;                    /**< \brief 8C, OTGM IRQ MUX Missed IRQ Select */
    Ifx_INT_OIXS0 OIXS0;                    /**< \brief 90, OTGM IRQ MUX Select 0 */
    Ifx_INT_OIXS1 OIXS1;                    /**< \brief 94, OTGM IRQ MUX Select 1 */
    unsigned char reserved_98[8];           /**< \brief 98, \internal Reserved */
    Ifx_INT_OIT OIT;                        /**< \brief A0, OTGM IRQ Trace */
    Ifx_INT_OMISP OMISP;                    /**< \brief A4, OTGM MCDS I/F Sensitivity Posedge */
    Ifx_INT_OMISN OMISN;                    /**< \brief A8, OTGM MCDS I/F Sensitivity Negedge */
    unsigned char reserved_AC[68];          /**< \brief AC, \internal Reserved */
    Ifx_INT_ACCEN_CONFIG0 ACCEN_CONFIG0;    /**< \brief F0, Access Enable CONFIG, Register 0 */
    Ifx_INT_ACCEN_CONFIG1 ACCEN_CONFIG1;    /**< \brief F4, Access Enable CONFIG, Register 1 */
    unsigned char reserved_F8[8];           /**< \brief F8, \internal Reserved */
    Ifx_INT_ACCEN_SRB00 ACCEN_SRB00;        /**< \brief 100, Access Enable SRB0, Register 0 */
    Ifx_INT_ACCEN_SRB01 ACCEN_SRB01;        /**< \brief 104, Access Enable SRB0, Register 1 */
    Ifx_INT_ACCEN_SRB10 ACCEN_SRB10;        /**< \brief 108, Access Enable SRB1, Register 0 */
    Ifx_INT_ACCEN_SRB11 ACCEN_SRB11;        /**< \brief 10C, Access Enable SRB1, Register 1 */
    Ifx_INT_ACCEN_SRB20 ACCEN_SRB20;        /**< \brief 110, Access Enable SRB2, Register 0 */
    Ifx_INT_ACCEN_SRB21 ACCEN_SRB21;        /**< \brief 114, Access Enable SRB2, Register 1 */
    Ifx_INT_ACCEN_SRB30 ACCEN_SRB30;        /**< \brief 118, Access Enable SRB3, Register 0 */
    Ifx_INT_ACCEN_SRB31 ACCEN_SRB31;        /**< \brief 11C, Access Enable SRB3, Register 1 */
    Ifx_INT_ACCEN_SRB40 ACCEN_SRB40;        /**< \brief 120, Access Enable SRB4, Register 0 */
    Ifx_INT_ACCEN_SRB41 ACCEN_SRB41;        /**< \brief 124, Access Enable SRB4, Register 1 */
    Ifx_INT_ACCEN_SRB50 ACCEN_SRB50;        /**< \brief 128, Access Enable SRB5, Register 0 */
    Ifx_INT_ACCEN_SRB51 ACCEN_SRB51;        /**< \brief 12C, Access Enable SRB5, Register 1 */
    unsigned char reserved_130[80];         /**< \brief 130, \internal Reserved */
    Ifx_INT_ACCEN_SRC_TOS00 ACCEN_SRC_TOS00;    /**< \brief 180, Access Enable SRC[31:16] TOS0, Register 0 */
    Ifx_INT_ACCEN_SRC_TOS01 ACCEN_SRC_TOS01;    /**< \brief 184, Access Enable SRC[15:0] TOS0, Register 1 */
    Ifx_INT_ACCEN_SRC_TOS10 ACCEN_SRC_TOS10;    /**< \brief 188, Access Enable SRC[31:16] TOS1, Register 0 */
    Ifx_INT_ACCEN_SRC_TOS11 ACCEN_SRC_TOS11;    /**< \brief 18C, Access Enable SRC[15:0] TOS1, Register 1 */
    Ifx_INT_ACCEN_SRC_TOS20 ACCEN_SRC_TOS20;    /**< \brief 190, Access Enable SRC[31:16] TOS2, Register 0 */
    Ifx_INT_ACCEN_SRC_TOS21 ACCEN_SRC_TOS21;    /**< \brief 194, Access Enable SRC[15:0] TOS2, Register 1 */
    Ifx_INT_ACCEN_SRC_TOS30 ACCEN_SRC_TOS30;    /**< \brief 198, Access Enable SRC[31:16] TOS3, Register 0 */
    Ifx_INT_ACCEN_SRC_TOS31 ACCEN_SRC_TOS31;    /**< \brief 19C, Access Enable SRC[15:0] TOS3, Register 1 */
    Ifx_INT_ACCEN_SRC_TOS40 ACCEN_SRC_TOS40;    /**< \brief 1A0, Access Enable SRC[31:16] TOS4, Register 0 */
    Ifx_INT_ACCEN_SRC_TOS41 ACCEN_SRC_TOS41;    /**< \brief 1A4, Access Enable SRC[15:0] TOS4, Register 1 */
    Ifx_INT_ACCEN_SRC_TOS50 ACCEN_SRC_TOS50;    /**< \brief 1A8, Access Enable SRC[31:16] TOS5, Register 0 */
    Ifx_INT_ACCEN_SRC_TOS51 ACCEN_SRC_TOS51;    /**< \brief 1AC, Access Enable SRC[15:0] TOS5, Register 1 */
    Ifx_INT_ACCEN_SRC_TOS60 ACCEN_SRC_TOS60;    /**< \brief 1B0, Access Enable SRC[31:16] TOS6, Register 0 */
    Ifx_INT_ACCEN_SRC_TOS61 ACCEN_SRC_TOS61;    /**< \brief 1B4, Access Enable SRC[15:0] TOS6, Register 1 */
    Ifx_INT_ACCEN_SRC_TOS70 ACCEN_SRC_TOS70;    /**< \brief 1B8, Access Enable SRC[31:16] TOS7, Register 0 */
    Ifx_INT_ACCEN_SRC_TOS71 ACCEN_SRC_TOS71;    /**< \brief 1BC, Access Enable SRC[15:0] TOS7, Register 1 */
    unsigned char reserved_1C0[64];         /**< \brief 1C0, \internal Reserved */
    Ifx_INT_ICU CH[8];                      /**< \brief 200, Interrupt router channel */
    unsigned char reserved_280[3456];       /**< \brief 280, \internal Reserved */
} Ifx_INT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXINT_REGDEF_H */
